In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(100)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [6]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.W

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [10]:
df['X']

A    0.342680
B    0.514219
C    0.255001
D    0.816847
E    1.029733
Name: X, dtype: float64

In [11]:
df[['W','Z']]

          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043
C -0.189496  0.435163
D -0.583595 -0.104411
E -0.531280 -1.118318

In [12]:
df['new'] = df['W'] + df['Y']

In [13]:
df['new']

A   -0.596730
B    1.202500
C   -0.647523
D    0.089126
E   -0.969416
Name: new, dtype: float64

In [14]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126
E -0.531280  1.029733 -0.438136 -1.118318 -0.969416

In [15]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [16]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126
E -0.531280  1.029733 -0.438136 -1.118318 -0.969416

In [17]:
df.drop('new',axis=1, inplace= True)

In [18]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [19]:
df.drop('E')

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [20]:
df.loc['A']

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [21]:
df.iloc[2]

W   -0.189496
X    0.255001
Y   -0.458027
Z    0.435163
Name: C, dtype: float64

In [22]:
df.loc['B', 'Y']

0.22117966922140045

In [23]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.749765  1.153036
B  0.981321  0.221180

In [24]:
#conditional selection
df > 0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [25]:
booldf  = df > 0

In [26]:
booldf

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [27]:
df[booldf]

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [28]:
df['W'] > 0

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [29]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [30]:
df[df['W'] > 0]

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

In [31]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [32]:
df[df['Z'] < 0]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [33]:
result = df[df['Z'] < 0]

In [34]:
result

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [35]:
result['X']

A    0.342680
B    0.514219
D    0.816847
E    1.029733
Name: X, dtype: float64

In [36]:
df[df['Z'] < 0]['X']

A    0.342680
B    0.514219
D    0.816847
E    1.029733
Name: X, dtype: float64

In [37]:
df[df['Z'] < 0][['X','Y']]

          X         Y
A  0.342680  1.153036
B  0.514219  0.221180
D  0.816847  0.672721
E  1.029733 -0.438136

In [38]:
boolser = df['W'] > 0

In [39]:
boolser

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [40]:
boolser = df['W'] > 0
result = df[boolser]

In [41]:
result

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

In [42]:
result[['Y','X']]

         Y         X
B  0.22118  0.514219

In [43]:
df[(df['W'] > 0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [44]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043

In [45]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [46]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.749765  0.342680  1.153036 -0.252436
1     B  0.981321  0.514219  0.221180 -1.070043
2     C -0.189496  0.255001 -0.458027  0.435163
3     D -0.583595  0.816847  0.672721 -0.104411
4     E -0.531280  1.029733 -0.438136 -1.118318

In [47]:
newInd = 'CA NY WY OR CO'.split()

In [48]:
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [49]:
df['States'] = newInd

In [50]:
df

          W         X         Y         Z States
A -1.749765  0.342680  1.153036 -0.252436     CA
B  0.981321  0.514219  0.221180 -1.070043     NY
C -0.189496  0.255001 -0.458027  0.435163     WY
D -0.583595  0.816847  0.672721 -0.104411     OR
E -0.531280  1.029733 -0.438136 -1.118318     CO

In [51]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.749765  0.342680  1.153036 -0.252436
NY      0.981321  0.514219  0.221180 -1.070043
WY     -0.189496  0.255001 -0.458027  0.435163
OR     -0.583595  0.816847  0.672721 -0.104411
CO     -0.531280  1.029733 -0.438136 -1.118318

In [52]:
df

          W         X         Y         Z States
A -1.749765  0.342680  1.153036 -0.252436     CA
B  0.981321  0.514219  0.221180 -1.070043     NY
C -0.189496  0.255001 -0.458027  0.435163     WY
D -0.583595  0.816847  0.672721 -0.104411     OR
E -0.531280  1.029733 -0.438136 -1.118318     CO

In [53]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.749765  0.342680  1.153036 -0.252436
NY      0.981321  0.514219  0.221180 -1.070043
WY     -0.189496  0.255001 -0.458027  0.435163
OR     -0.583595  0.816847  0.672721 -0.104411
CO     -0.531280  1.029733 -0.438136 -1.118318

In [58]:
#Index Level
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [59]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [60]:
df = pd.DataFrame(randn(6,2),hier_index)

In [61]:
df

             0         1
G1 1 -0.756352  0.816454
   2  0.750445 -0.455947
   3  1.189622 -1.690617
G2 1 -1.356399 -1.232435
   2 -0.544439 -0.668172
   3  0.007315 -0.612939

In [64]:
df.loc['G1'].loc[1]

0   -0.756352
1    0.816454
Name: 1, dtype: float64